app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all.sort_by(&:id)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @email = Email.find(params[:id])

INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "Hester Nolan JD"], ["body", "Chuck Norris programs do not accept input."], ["created_at", "2021-11-24 15:41:10.761138"], ["updated_at", "2021-11-24 15:41:10.761138"], ["read", false]]
---
  def create
    @email = Email.create(object: Faker::Name.unique.name, body: Faker::ChuckNorris.fact, read: false)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def edit
    @email = Email.find(params[:id])

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2021-11-25 10:02:23.530238"], ["id", 142]]
---
  def update
    @email = Email.find(params[:id])
    @email.update(read: false)

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 136]]
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy