app/views/emails/show.js.erb

UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2021-11-25 11:24:01.245310"], ["id", 187]]
---

<% @email.update(read: true) %>